public class HW5 {

    public static void main(String[] args) {
        //Task 5.1
//        Рекурсия достаточно распространённое явление, которое встречается не только в областях науки,
//        но и в повседневной жизни. Например, эффект Дросте, треугольник Серпинского и т. д.
//        Один из вариантов увидеть рекурсию – это навести Web-камеру на экран монитора компьютера,
//        естественно, предварительно её включив. Таким образом, камера будет записывать изображение
//        экрана компьютера, и выводить его же на этот экран, получится что-то вроде замкнутого цикла.
//        В итоге мы будем наблюдать нечто похожее на тоннель.

//        В программировании рекурсия тесно связана с функциями. Простыми словами,
//        рекурсия – определение части функции (метода) через саму себя,
//        то есть это функция, которая вызывает саму себя, непосредственно (в своём теле) или
//        косвенно (через другую функцию).
        
        //Task 5.2
    }
}
